; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v1)
             (pred_11 ?v8 ?v9)
             (pred_4 ?v11 ?v9)
             (pred_5 ?v6 ?v11 )
	     (pred_7 ?v11)
             (pred_3 ?v3)
             (pred_12 ?v8)
             (pred_2 ?v9)
             (pred_6 ?v11)
             (pred_9 ?v8)
             (pred_8 ?v11)
             (pred_10 ))



(:action op_3
:parameters (?v7 ?v2 ?v10 ?v4)
:precondition (and (pred_3 ?v7) (pred_3 ?v2) (pred_12 ?v10) (pred_2 ?v4)
          (pred_1 ?v7 ?v2) (pred_11 ?v10 ?v4)
                   (pred_4 ?v2 ?v4) (pred_7 ?v7) 
                   (pred_6 ?v2) (pred_9 ?v10))
:effect (and  (pred_8 ?v2) (not (pred_6 ?v2))))


(:action op_1
:parameters (?v7 ?v5)
:precondition (and (pred_3 ?v7) (pred_3 ?v5)
               (pred_7 ?v7) (pred_1 ?v7 ?v5) (pred_8 ?v5))
:effect (and (pred_7 ?v5) (not (pred_7 ?v7))))

(:action op_5
:parameters (?v7 ?v10)
:precondition (and (pred_3 ?v7) (pred_12 ?v10) 
                  (pred_7 ?v7) (pred_5 ?v10 ?v7) (pred_10 ))
:effect (and (pred_9 ?v10)
   (not (pred_5 ?v10 ?v7)) (not (pred_10 ))))


(:action op_4
:parameters (?v7 ?v13 ?v12)
:precondition (and (pred_3 ?v7) (pred_12 ?v13) (pred_12 ?v12)
                  (pred_7 ?v7) (pred_9 ?v12) (pred_5 ?v13 ?v7))
:effect (and (pred_9 ?v13) (pred_5 ?v12 ?v7)
        (not (pred_9 ?v12)) (not (pred_5 ?v13 ?v7))))

(:action op_2
:parameters (?v7 ?v10)
:precondition (and (pred_3 ?v7) (pred_12 ?v10) 
                  (pred_7 ?v7) (pred_9 ?v10))
:effect (and (pred_10 ) (pred_5 ?v10 ?v7) (not (pred_9 ?v10)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_13 obj_01 obj_21 obj_30 obj_22 obj_09 obj_14 obj_05 obj_10 obj_27 obj_15 obj_29 obj_17 obj_06 obj_07 obj_12 obj_03 obj_24 obj_19 obj_04 obj_25 obj_28 obj_23 obj_26
    obj_20 obj_18
    obj_02 obj_16 obj_11
    )

    (:init
       (pred_10)

       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_30)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_3 obj_27)
       (pred_3 obj_15)
       (pred_3 obj_29)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_3 obj_07)
       (pred_3 obj_12)
       (pred_3 obj_03)
       (pred_3 obj_24)
       (pred_3 obj_19)
       (pred_3 obj_04)
       (pred_3 obj_25)
       (pred_3 obj_28)
       (pred_3 obj_23)
       (pred_3 obj_26)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_11)

       (pred_1 obj_08 obj_22)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_21)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_21 obj_30)
       (pred_1 obj_21 obj_01)
       (pred_1 obj_30 obj_10)
       (pred_1 obj_30 obj_21)
       (pred_1 obj_22 obj_27)
       (pred_1 obj_22 obj_09)
       (pred_1 obj_22 obj_08)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_09 obj_22)
       (pred_1 obj_14 obj_29)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_05 obj_10)
       (pred_1 obj_05 obj_21)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_10 obj_30)
       (pred_1 obj_10 obj_05)
       (pred_1 obj_27 obj_07)
       (pred_1 obj_27 obj_15)
       (pred_1 obj_27 obj_22)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_29)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_15 obj_27)
       (pred_1 obj_29 obj_03)
       (pred_1 obj_29 obj_17)
       (pred_1 obj_29 obj_14)
       (pred_1 obj_29 obj_15)
       (pred_1 obj_17 obj_24)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_17 obj_29)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_27)
       (pred_1 obj_12 obj_25)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_03 obj_28)
       (pred_1 obj_03 obj_24)
       (pred_1 obj_03 obj_29)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_24 obj_23)
       (pred_1 obj_24 obj_19)
       (pred_1 obj_24 obj_17)
       (pred_1 obj_24 obj_03)
       (pred_1 obj_19 obj_26)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_19 obj_24)
       (pred_1 obj_04 obj_25)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_25 obj_28)
       (pred_1 obj_25 obj_12)
       (pred_1 obj_25 obj_04)
       (pred_1 obj_28 obj_23)
       (pred_1 obj_28 obj_03)
       (pred_1 obj_28 obj_25)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_23 obj_24)
       (pred_1 obj_23 obj_28)
       (pred_1 obj_26 obj_19)
       (pred_1 obj_26 obj_23)
       (pred_6 obj_27)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_4  obj_27 obj_20)
       (pred_4  obj_13 obj_18)
       (pred_4  obj_12 obj_18)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_30)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_15)
       (pred_8 obj_29)
       (pred_8 obj_17)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_24)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_8 obj_25)
       (pred_8 obj_28)
       (pred_8 obj_23)
       (pred_8 obj_26)

       (pred_11  obj_02 obj_20)
       (pred_11  obj_16 obj_18)
       (pred_11  obj_11 obj_18)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_16 obj_26)
       (pred_5 obj_11 obj_25)
       (pred_7 obj_15)
    )

    (:goal (and
       (pred_5 obj_16 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_19)))
)
)

; plan
1. (op_1 obj_15 obj_09)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_09)
   goals met: 0 of 1
2. (op_1 obj_09 obj_14)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_14)
   goals met: 0 of 1
3. (op_1 obj_14 obj_05)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_17)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_17)
   goals met: 0 of 1
5. (op_1 obj_17 obj_24)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_24)
   goals met: 0 of 1
6. (op_1 obj_24 obj_23)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_23)
   goals met: 0 of 1
7. (op_1 obj_23 obj_26)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_26)
   goals met: 0 of 1
8. (op_5 obj_26 obj_16)
   deleted: (pred_5 obj_16 obj_26) (pred_10)
   added: (pred_9 obj_16)
   goals met: 0 of 1
9. (op_1 obj_26 obj_23)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_23)
   goals met: 0 of 1
10. (op_1 obj_23 obj_24)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_24)
   goals met: 0 of 1
11. (op_1 obj_24 obj_17)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_17)
   goals met: 0 of 1
12. (op_1 obj_17 obj_05)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_05)
   goals met: 0 of 1
13. (op_1 obj_05 obj_14)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_14)
   goals met: 0 of 1
14. (op_1 obj_14 obj_09)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_09)
   goals met: 0 of 1
15. (op_1 obj_09 obj_22)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_22)
   goals met: 0 of 1
16. (op_1 obj_22 obj_08)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_08)
   goals met: 0 of 1
17. (op_2 obj_08 obj_16)
   deleted: (pred_9 obj_16)
   added: (pred_10) (pred_5 obj_16 obj_08)
   goals met: 1 of 1
